Тест_ЗУП_31_КОРП/src/InformationRegisters/НастройкиОбученияРазвития/НастройкиОбученияРазвития.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиОбученияРазвития</name>
  <resources>
    <name>ИспользоватьОбучениеРазвитиеСотрудников</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьПубликацииМероприятийОбученияРазвития</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьУченическиеДоговоры</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
</mdclass:InformationRegister>

Тест_ЗУП_31_КОРП/src/InformationRegisters/НастройкиОбученияРазвития/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область ПервоначальноеЗаполнениеИОбновлениеИнформационнойБазы

Процедура ВключитьИспользованиеПубликацийМероприятийОбученияРазвития(Параметры = Неопределено) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьСамообслуживаниеСотрудников") Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.НастройкиОбученияРазвития.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0
		Или Не НаборЗаписей[0].ИспользоватьОбучениеРазвитиеСотрудников Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей[0].ИспользоватьПубликацииМероприятийОбученияРазвития = Истина;
	
	ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
	
КонецПроцедуры

#КонецОбласти

Процедура УстановитьНастройкуИспользоватьПубликацииМероприятийОбученияРазвития(ИспользоватьСамообслуживаниеСотрудников) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.НастройкиОбученияРазвития.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 
		Или Не НаборЗаписей[0].ИспользоватьОбучениеРазвитиеСотрудников
		Или НаборЗаписей[0].ИспользоватьПубликацииМероприятийОбученияРазвития = ИспользоватьСамообслуживаниеСотрудников Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей.ДополнительныеСвойства.Вставить("ИспользоватьПубликацииМероприятийОбученияРазвития", ИспользоватьСамообслуживаниеСотрудников);
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
